RIET/src/Catalogs/rgsBudgetItem/rgsBudgetItem.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>rgsBudgetItem</name>
  <attributes>
    <name>BudgetPercentType</name>
    <type>
      <types>EnumRef.rgsBudgetPercentTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupLevel</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
      <types>CatalogRef.rgsBudgetItem</types>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubLevel</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
      <types>EnumRef.DomesticInternational</types>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/rgsBudgetPercentTypes/rgsBudgetPercentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>rgsBudgetPercentTypes</name>
  <enumValues>
    <name>InternationalDomestic</name>
  </enumValues>
  <enumValues>
    <name>Sub_Geomarket</name>
  </enumValues>
  <enumValues>
    <name>Sub_Segment</name>
  </enumValues>
  <enumValues>
    <name>SubGeomarket_Segment</name>
  </enumValues>
  <enumValues>
    <name>Geomarket_Segment</name>
  </enumValues>
  <enumValues>
    <name>RevenueProcent</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/rgsBudgetItem/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если BudgetPercentType <> Перечисления.rgsBudgetPercentTypes.RevenueProcent тогда
		
		Если Не ЗначениеЗаполнено(SubLevel) тогда
		Отказ = Истина;
		Message = New UserMessage();
		Message.Text = "Не заполнено поле SubLevel";
		Message.Message();			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	rgsBudgetItem.Ссылка
	               |ИЗ
	               |	Справочник.rgsBudgetItem КАК rgsBudgetItem
	               |ГДЕ
	               |	rgsBudgetItem.BudgetPercentType = &BudgetPercentType
	               |	И rgsBudgetItem.GroupLevel = &GroupLevel
	               |	И rgsBudgetItem.SubLevel = &SubLevel
	               |	И rgsBudgetItem.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("BudgetPercentType",BudgetPercentType);
	Запрос.УстановитьПараметр("GroupLevel",GroupLevel);
	Запрос.УстановитьПараметр("SubLevel",SubLevel);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 тогда
		Отказ = Истина;
		Message = New UserMessage();
		Message.Text = "Уже есть элемент с такими реквизитами";
		Message.Message();
	КонецЕсли;
	
	
	
КонецПроцедуры
